import operator
from loguru import logger
import torch
import torch.nn as nn
import numpy as np
import os
import sys
sys.path.append('..')


# 实现FocalLoss的类
class FocalLoss(nn.Module):
    def __init__(self, num_labels, activation_type='sigmoid', gamma=2.0, alpha=0.25, epsilon=1.e-9):
        super(FocalLoss, self).__init__()
        # 1: 分类问题的标签数量
        self.num_labels = num_labels
        
        # 2: FocalLoss算法中的指数参数
        self.gamma = gamma
        
        # 3: FocalLoss算法中的外围系数
        self.alpha = alpha
        
        # 4: 除法防止分母为零的极小正数
        self.epsilon = epsilon
        
        # 5: 二分类/多分类的不同计算策略
        self.activation_type = activation_type

    def forward(self, input, target): 
        # 解决二分类问题, 损失函数设置为sigmoid
        multi_hot_key = target
        # multi_hot_key: multi_hot_key:  tensor([0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.,
        #                                        0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
        #                                        0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
        #                                        ......
        #                                        0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0.])
        # multi_hot_key.shape: [792]

        # 对于二分类问题, 直接在input上应用sigmoid即可
        # input: tensor([ 0.0571, -0.3086,  0.0277, -0.3813, -0.5807, -0.5638, -0.8845, -0.7329,
        #                -0.5965, -0.0347, -0.1665, -0.5756, -0.3665, -0.5662, -0.4041, -0.4876,
        #                -0.8623, -0.7951, -1.2100, -1.3447, -0.8913, -0.5606, -0.7767, -0.8011,
        #                ......
        #                -0.4594, -0.5124, -0.1748, -0.6126, -0.4070, -0.6587, -0.5607, -0.1893])
        # input.shape: [792]

        logits = torch.sigmoid(input)
        # logits: tensor([0.5143, 0.4235, 0.5069, 0.4058, 0.3588, 0.3627, 0.2922, 0.3246, 0.3551,
        #                 0.4913, 0.4585, 0.3599, 0.4094, 0.3621, 0.4003, 0.3805, 0.2969, 0.3111,
        #                 0.2297, 0.2067, 0.2908, 0.3634, 0.3150, 0.3098, 0.3960, 0.3839, 0.2750,
        #                 ......
        #                 0.4261, 0.3871, 0.3746, 0.4564, 0.3515, 0.3996, 0.3410, 0.3634, 0.4528])
        # logits.shape: [792]

        zero_hot_key = 1 - multi_hot_key
        # zero_hot_key: tensor([1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1.,
        #                       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
        #                       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
        #                       ......
        #                       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1.]
        # zero_hot_key.shape: [792]

        # 按照二分类的计算公式, loss需要加和两部分, 分别是标签为1对应的alpha
        loss = -self.alpha * multi_hot_key * torch.pow((1 - logits), self.gamma) * (logits + self.epsilon).log()
        # loss: tensor([0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000,
        #               0.0000, 0.0000, 0.1047, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000,
        #               0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000,
        #               ......
        #               0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.1026, 0.0000]

        # loss还需要加和标签为0对应的(1 - alpha)
        loss += -(1 - self.alpha) * zero_hot_key * torch.pow(logits, self.gamma) * (1 - logits + self.epsilon).log()
        # loss: tensor([0.1432, 0.0741, 0.1363, 0.0643, 0.0429, 0.0444, 0.0221, 0.0310, 0.0415,
        #               0.1224, 0.0967, 0.1047, 0.0662, 0.0442, 0.0615, 0.0520, 0.0233, 0.0270,
        #               0.0103, 0.0074, 0.0218, 0.0447, 0.0282, 0.0267, 0.0593, 0.0535, 0.0182,
        #               ......
        #               0.0756, 0.0550, 0.0494, 0.0952, 0.0401, 0.0611, 0.0364, 0.1026, 0.0927])
        # loss.shape: [792]
        
        # 最后返回批次的平均损失值
        return loss.mean()

